app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
      redirect_to book_path(@book), notice: "Book was successfully created."
    else
      @books = Book.all
---
INSERT INTO "books" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2024-07-16 11:31:21.170521"], ["updated_at", "2024-07-16 11:31:21.170521"], ["title", "ss"], ["body", "jpij"]]
SELECT "books".* FROM "books" WHERE (index) LIMIT ?  [["LIMIT", 1]]

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = ?, "title" = ?, "body" = ? WHERE "books"."id" = ?  [["updated_at", "2024-07-09 09:16:42.299796"], ["title", "2233"], ["body", "wwee"], ["id", 24]]

  def destroy
    if @book
      @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 18]]

  def set_book
    @book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]